package ru.rzn.sbt.javaschool.rdd

/**
 *"in/log_19950701.tsv" файл содержит 10000 строк лога с одного из серверов за 1 июля 1995 года.
 * "in/log_19950801.tsv" файл содержит 10000 строк лога с одного из серверов за 1 августа 1995 года.
 *  Создайте Spark программу для генерации нового RDD, который содержит лог за оба эти дня.
 *  Возьмите выборку с параметром fraction: 0.1 из полученного RDD и сохраните в файл  "out/logs.tsv"
 *  Учтите, что в исходных файлах содержатся строки с заголовками.
 *  host	logname	time	method	url	response	bytes
 *  Удалите заголовки из результирующего файла.
 */
object UnionLog extends App {

}
